#include <iostream>

using namespace std;


/*
Десетата цифра е контролна и се изчислява по следния алгоритъм:

Всяка от първите девет цифри се умножава по съответното ѝ тегло (виж таблицата) и резултатите се сумират;
Получената сума се дели на 11 с остатък;
Ако остатъкът от делението е по-малък от 10, тогава той се взема като контролна цифра, иначе за контролна се взема цифрата 0.

Пример: 6101057509 – мъж, с дата на раждане 5 януари 1961 г. Забележка: ЕГН е коректен, но такова лице не съществува.

Изчисляване на контролната цифра в примера:

6*2 + 1*4 + 0*8 + 1*5 + 0*10 + 5*9 + 7*7 + 5*3 + 0*6 = 130;
Делим получената сума на 11 и получаваме дроб: 130/11 = 11,(81);
За да намерим остатъка, умножаваме цялата част от получената дроб по 11 и изваждаме резултата от първоначалната сума: 130 - 11*11 = 9;
Kонтролната цифра е 9.
+------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
| Позиция    |  1  |  2  |  3  |  4  |  5  |  6  |  7  |  8  |  9  |  10 |
+------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
| Тегло      |  x2 |  x4 |  x8 |  x5 | x10 |  x9 |  x7 |  x3 |  x6 |     |
+------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
*/


/*
+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
|  0  |  1  |  2  |  3  |  4  |  5  |  6  |  7  |  8  |  9  |
+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
|     |     |     |     |     |     |     |     |     |     |
+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
*/
void convertToDigits(long egn,       // pass by value
					 int digits[]) { // pass by reference

	for (int i = 9; i >= 0; i--) {
		int lastDigit = egn % 10;
		digits[i] = lastDigit;
		
		egn = egn / 10;
	}
}

bool validChecksum(long egn) {
	int coefficients[9] = {2, 4, 8, 5, 10, 9, 7, 3, 6};
	
	int digits[10] = {0};
	convertToDigits(egn, digits);

	int sum = 0;
	for (int i = 0; i < 9; i++) {
		sum += digits[i] * coefficients[i];
	}

	// [0, 1, 2, 3, 4 ....9 | 10 --> 0]
	int calculatedChecksum = (sum % 11) % 10;
	
	return digits[9] == calculatedChecksum;
}


void print(int arr[], int n) {
	for (int i = 0; i < n; i++) {
		cout << arr[i] << " ";
	}
	cout << endl;
}

int main() {
	cout << "true == " << validChecksum(5021129212l) << endl; // ok
	cout << "true == " << validChecksum(6101057509l) << endl; // ok
	cout << "false == " << validChecksum(5809058590l) << endl; // invalid checksum
}




